#pragma once
#include "iostream"
#include <chrono>
#include <thread>
#include "ncurses.h"

class Game {
   public:
    bool is_running = true;

    // field
    static const int FIELD_H = 20;      // hight
    static const int FIELD_W = 10;      // width
    int field[FIELD_H][FIELD_W] = {0};  // note that 0 for empty 1 for full.

    struct Tetromino {
        int type;
        int rotation;
        int x;
        int y;
        int points;
    };
    Tetromino t;

    const int shapes[7][4][4][4] = {
        // I-тип
        {// Поворот 0
         {{0, 0, 0, 0}, {1, 1, 1, 1}, {0, 0, 0, 0}, {0, 0, 0, 0}},
         // Поворот 1
         {{0, 1, 0, 0}, {0, 1, 0, 0}, {0, 1, 0, 0}, {0, 1, 0, 0}},
         // Поворот 2
         {{0, 0, 0, 0}, {1, 1, 1, 1}, {0, 0, 0, 0}, {0, 0, 0, 0}},
         // Поворот 3
         {{0, 1, 0, 0}, {0, 1, 0, 0}, {0, 1, 0, 0}, {0, 1, 0, 0}}},
        // J-тип
        {
            {{0, 0, 0, 0}, {1, 1, 1, 0}, {1, 0, 0, 0}, {0, 0, 0, 0}},  // Поворот 0
            {{1, 0, 0, 0}, {1, 1, 1, 0}, {0, 0, 0, 0}, {0, 0, 0, 0}},  // Поворот 1
            {{0, 0, 0, 0}, {0, 0, 1, 1}, {1, 1, 1, 0}, {0, 0, 0, 0}},  // Поворот 2
            {{1, 0, 0, 0}, {1, 1, 1, 0}, {0, 0, 0, 0}, {0, 0, 0, 0}}   // Поворот 3
        },
        // L-тип
        {
            {{0, 0, 0, 0}, {0, 1, 1, 1}, {0, 0, 0, 1}, {0, 0, 0, 0}},  // Поворот 0
            {{0, 1, 0, 0}, {0, 1, 0, 0}, {0, 1, 1, 1}, {0, 0, 0, 0}},  // Поворот 1
            {{0, 0, 0, 0}, {1, 0, 0, 0}, {1, 1, 1, 0}, {0, 0, 0, 0}},  // Поворот 2
            {{1, 1, 0, 0}, {0, 1, 0, 0}, {0, 1, 1, 1}, {0, 0, 0, 0}}   // Поворот 3
        },
        // O-тип
        {
            {{0, 0, 0, 0}, {0, 1, 1, 0}, {0, 1, 1, 0}, {0, 0, 0, 0}},  // Поворот 0
            {{0, 0, 0, 0}, {0, 1, 1, 0}, {0, 1, 1, 0}, {0, 0, 0, 0}},  // Поворот 1
            {{0, 0, 0, 0}, {0, 1, 1, 0}, {0, 1, 1, 0}, {0, 0, 0, 0}},  // Поворот 2
            {{0, 0, 0, 0}, {0, 1, 1, 0}, {0, 1, 1, 0}, {0, 0, 0, 0}}   // Поворот 3
        },
        // S-тип
        {
            {{0, 0, 0, 0}, {0, 1, 1, 0}, {1, 1, 0, 0}, {0, 0, 0, 0}},  // Поворот 0
            {{1, 0, 0, 0}, {1, 1, 0, 0}, {0, 1, 0, 0}, {0, 0, 0, 0}},  // Поворот 1
            {{0, 0, 0, 0}, {0, 1, 1, 0}, {1, 1, 0, 0}, {0, 0, 0, 0}},  // Поворот 2
            {{1, 0, 0, 0}, {1, 1, 0, 0}, {0, 1, 0, 0}, {0, 0, 0, 0}}   // Поворот 3
        },
        // T-тип
        {

            {{0, 0, 0, 0}, {1, 1, 1, 0}, {0, 1, 0, 0}, {0, 0, 0, 0}},  // Поворот 0
            {{0, 1, 0, 0}, {1, 1, 1, 0}, {0, 1, 0, 0}, {0, 0, 0, 0}},  // Поворот 1
            {{0, 1, 0, 0}, {1, 1, 1, 0}, {0, 0, 0, 0}, {0, 0, 0, 0}},  // Поворот 2
            {{0, 1, 0, 0}, {1, 1, 1, 0}, {0, 1, 0, 0}, {0, 0, 0, 0}}   // Поворот 3
        },
        // Z-тип
        {
            {{0, 0, 0, 0}, {1, 1, 0, 0}, {0, 1, 1, 0}, {0, 0, 0, 0}},  // Поворот 0
            {{0, 1, 0, 0}, {1, 1, 0, 0}, {1, 0, 0, 0}, {0, 0, 0, 0}},  // Поворот 1
            {{0, 0, 0, 0}, {1, 1, 0, 0}, {0, 1, 1, 0}, {0, 0, 0, 0}},  // Поворот 2
            {{0, 1, 0, 0}, {1, 1, 0, 0}, {1, 0, 0, 0}, {0, 0, 0, 0}}   // Поворот 3
        }};


    int score = 0;

    bool check_collision(const Tetromino& t);
    bool line_is_full(int row);
    bool is_game_over();

    Tetromino create_random_tetromino();

    void move_down(Tetromino& t);
    void move_left(Tetromino& t);
    void move_right(Tetromino& t);
    void rotate(Tetromino& t);
    void update();
    void clean_line();
    void clear_line(int row);
    void spawn_new_tetromino();
    void lock_tetromino(const Tetromino& t);
};
