#pragma once
// #include "stucture.hpp"

class Game {
   public:
    bool is_running = true;

    // field
    static const int FIELD_H = 20;      // hight
    static const int FIELD_W = 10;      // width
    int field[FIELD_H][FIELD_W] = {0};  // note that 0 for empty 1 for full.

    // tetromino
    // i think we need to initialize it 
    struct Tetromino {
        int type;
        int rotation;
        int x;
        int y;
    };
  Tetromino t; 
  // Tetromino t = {0, 0, FIELD_W / 2, 0}; something like that for start

    const int shapes[7][4][4][4] = {
        // I-тип
        {// Поворот 0
         {{0, 0, 0, 0}, {1, 1, 1, 1}, {0, 0, 0, 0}, {0, 0, 0, 0}},
         // Поворот 1
         {{0, 1, 0, 0}, {0, 1, 0, 0}, {0, 1, 0, 0}, {0, 1, 0, 0}},
         // Поворот 2
         {{0, 0, 0, 0}, {1, 1, 1, 1}, {0, 0, 0, 0}, {0, 0, 0, 0}},
         // Поворот 3
         {{0, 1, 0, 0}, {0, 1, 0, 0}, {0, 1, 0, 0}, {0, 1, 0, 0}}},
        // J-тип
        {
            {{0, 0, 0, 0}, {1, 1, 1, 0}, {1, 0, 0, 0}, {0, 0, 0, 0}},  // Поворот 0
            {{1, 0, 0, 0}, {1, 1, 1, 0}, {0, 0, 0, 0}, {0, 0, 0, 0}},  // Поворот 1
            {{0, 0, 0, 0}, {0, 0, 1, 1}, {1, 1, 1, 0}, {0, 0, 0, 0}},  // Поворот 2
            {{1, 0, 0, 0}, {1, 1, 1, 0}, {0, 0, 0, 0}, {0, 0, 0, 0}}   // Поворот 3
        },
        // L-тип
        {
            {{0, 0, 0, 0}, {0, 1, 1, 1}, {0, 0, 0, 1}, {0, 0, 0, 0}},  // Поворот 0
            {{0, 1, 0, 0}, {0, 1, 0, 0}, {0, 1, 1, 1}, {0, 0, 0, 0}},  // Поворот 1
            {{0, 0, 0, 0}, {1, 0, 0, 0}, {1, 1, 1, 0}, {0, 0, 0, 0}},  // Поворот 2
            {{1, 1, 0, 0}, {0, 1, 0, 0}, {0, 1, 1, 1}, {0, 0, 0, 0}}   // Поворот 3
        },
        // O-тип
        {
            {{0, 0, 0, 0}, {0, 1, 1, 0}, {0, 1, 1, 0}, {0, 0, 0, 0}},  // Поворот 0
            {{0, 0, 0, 0}, {0, 1, 1, 0}, {0, 1, 1, 0}, {0, 0, 0, 0}},  // Поворот 1
            {{0, 0, 0, 0}, {0, 1, 1, 0}, {0, 1, 1, 0}, {0, 0, 0, 0}},  // Поворот 2
            {{0, 0, 0, 0}, {0, 1, 1, 0}, {0, 1, 1, 0}, {0, 0, 0, 0}}   // Поворот 3
        },
        // S-тип
        {
            {{0, 0, 0, 0}, {0, 1, 1, 0}, {1, 1, 0, 0}, {0, 0, 0, 0}},  // Поворот 0
            {{1, 0, 0, 0}, {1, 1, 0, 0}, {0, 1, 0, 0}, {0, 0, 0, 0}},  // Поворот 1
            {{0, 0, 0, 0}, {0, 1, 1, 0}, {1, 1, 0, 0}, {0, 0, 0, 0}},  // Поворот 2
            {{1, 0, 0, 0}, {1, 1, 0, 0}, {0, 1, 0, 0}, {0, 0, 0, 0}}   // Поворот 3
        },
        // T-тип
        {

            {{0, 0, 0, 0}, {1, 1, 1, 0}, {0, 1, 0, 0}, {0, 0, 0, 0}},  // Поворот 0
            {{0, 1, 0, 0}, {1, 1, 1, 0}, {0, 1, 0, 0}, {0, 0, 0, 0}},  // Поворот 1
            {{0, 1, 0, 0}, {1, 1, 1, 0}, {0, 0, 0, 0}, {0, 0, 0, 0}},  // Поворот 2
            {{0, 1, 0, 0}, {1, 1, 1, 0}, {0, 1, 0, 0}, {0, 0, 0, 0}}   // Поворот 3
        },
        // Z-тип
        {
            {{0, 0, 0, 0}, {1, 1, 0, 0}, {0, 1, 1, 0}, {0, 0, 0, 0}},  // Поворот 0
            {{0, 1, 0, 0}, {1, 1, 0, 0}, {1, 0, 0, 0}, {0, 0, 0, 0}},  // Поворот 1
            {{0, 0, 0, 0}, {1, 1, 0, 0}, {0, 1, 1, 0}, {0, 0, 0, 0}},  // Поворот 2
            {{0, 1, 0, 0}, {1, 1, 0, 0}, {1, 0, 0, 0}, {0, 0, 0, 0}}   // Поворот 3
        }};



    // score
    int score = 0;  // intial value

    // void move_down(Tetromino& t);
    //  void move_left(Tetromino& t);
    //  void move_right(Tetromino& t);
    //  void rotate(Tetromino& t);
    void update();
    // void clean_line();
    // bool line_is_full(int row);
    // void clear_line(int row);
    // bool can_move_down(const Tetromino& t);
};
