#pragma once

// #include <fcntl.h>
// #include <termios.h>
// #include <unistd.h>
//
// //#include <chrono>
// #include <cstdio>
// #include <cstdlib>
// //#include <thread>
//
//


#include <termios.h>
#include <iostream>
#include <vector>





// // field
// // static const int FIELD_H = 20;       // hight
// // static const int FIELD_W = 10;       // width
// // static int field[FIELD_H][FIELD_W] = {0};  // note that 0 for empty 1 for full.


// struct Field {
//     static constexpr int height = 20;
//     static constexpr int width  = 10;

//   //int cells[height][width] = {};
// };

// // field на перенести.





// // score
// static int score = 0;  // intial value



// // structs

// struct Tetromino {
//     int type;
//     int rotation;
//     int x;
//     int y;
// };
// extern Tetromino t;





// const int shapes[7][4][4][4] = {
//     // I-тип
//     {// Поворот 0
//      {{0, 0, 0, 0}, {1, 1, 1, 1}, {0, 0, 0, 0}, {0, 0, 0, 0}},
//      // Поворот 1
//      {{0, 1, 0, 0}, {0, 1, 0, 0}, {0, 1, 0, 0}, {0, 1, 0, 0}},
//      // Поворот 2
//      {{0, 0, 0, 0}, {1, 1, 1, 1}, {0, 0, 0, 0}, {0, 0, 0, 0}},
//      // Поворот 3
//      {{0, 1, 0, 0}, {0, 1, 0, 0}, {0, 1, 0, 0}, {0, 1, 0, 0}}},
//     // J-тип
//     {
//         {{0, 0, 0, 0}, {1, 1, 1, 0}, {1, 0, 0, 0}, {0, 0, 0, 0}},  // Поворот 0
//         {{1, 0, 0, 0}, {1, 1, 1, 0}, {0, 0, 0, 0}, {0, 0, 0, 0}},  // Поворот 1
//         {{0, 0, 0, 0}, {0, 0, 1, 1}, {1, 1, 1, 0}, {0, 0, 0, 0}},  // Поворот 2
//         {{1, 0, 0, 0}, {1, 1, 1, 0}, {0, 0, 0, 0}, {0, 0, 0, 0}}   // Поворот 3
//     },
//     // L-тип
//     {
//         {{0, 0, 0, 0}, {0, 1, 1, 1}, {0, 0, 0, 1}, {0, 0, 0, 0}},  // Поворот 0
//         {{0, 1, 0, 0}, {0, 1, 0, 0}, {0, 1, 1, 1}, {0, 0, 0, 0}},  // Поворот 1
//         {{0, 0, 0, 0}, {1, 0, 0, 0}, {1, 1, 1, 0}, {0, 0, 0, 0}},  // Поворот 2
//         {{1, 1, 0, 0}, {0, 1, 0, 0}, {0, 1, 1, 1}, {0, 0, 0, 0}}   // Поворот 3
//     },
//     // O-тип
//     {
//         {{0, 0, 0, 0}, {0, 1, 1, 0}, {0, 1, 1, 0}, {0, 0, 0, 0}},  // Поворот 0
//         {{0, 0, 0, 0}, {0, 1, 1, 0}, {0, 1, 1, 0}, {0, 0, 0, 0}},  // Поворот 1
//         {{0, 0, 0, 0}, {0, 1, 1, 0}, {0, 1, 1, 0}, {0, 0, 0, 0}},  // Поворот 2
//         {{0, 0, 0, 0}, {0, 1, 1, 0}, {0, 1, 1, 0}, {0, 0, 0, 0}}   // Поворот 3
//     },
//     // S-тип
//     {
//         {{0, 0, 0, 0}, {0, 1, 1, 0}, {1, 1, 0, 0}, {0, 0, 0, 0}},  // Поворот 0
//         {{1, 0, 0, 0}, {1, 1, 0, 0}, {0, 1, 0, 0}, {0, 0, 0, 0}},  // Поворот 1
//         {{0, 0, 0, 0}, {0, 1, 1, 0}, {1, 1, 0, 0}, {0, 0, 0, 0}},  // Поворот 2
//         {{1, 0, 0, 0}, {1, 1, 0, 0}, {0, 1, 0, 0}, {0, 0, 0, 0}}   // Поворот 3
//     },
//     // T-тип
//     {
//         {{0, 0, 0, 0}, {1, 1, 1, 0}, {0, 1, 0, 0}, {0, 0, 0, 0}},  // Поворот 0
//         {{0, 1, 0, 0}, {1, 1, 1, 0}, {0, 1, 0, 0}, {0, 0, 0, 0}},  // Поворот 1
//         {{0, 1, 0, 0}, {1, 1, 1, 0}, {0, 0, 0, 0}, {0, 0, 0, 0}},  // Поворот 2
//         {{0, 1, 0, 0}, {1, 1, 1, 0}, {0, 1, 0, 0}, {0, 0, 0, 0}}   // Поворот 3
//     },
//     // Z-тип
//     {
//         {{0, 0, 0, 0}, {1, 1, 0, 0}, {0, 1, 1, 0}, {0, 0, 0, 0}},  // Поворот 0
//         {{0, 1, 0, 0}, {1, 1, 0, 0}, {1, 0, 0, 0}, {0, 0, 0, 0}},  // Поворот 1
//         {{0, 0, 0, 0}, {1, 1, 0, 0}, {0, 1, 1, 0}, {0, 0, 0, 0}},  // Поворот 2
//         {{0, 1, 0, 0}, {1, 1, 0, 0}, {1, 0, 0, 0}, {0, 0, 0, 0}}   // Поворот 3
//     }
// };



// struct TerminalState {
//          termios settings;
//      };









// /*
// переосмыслеть использованиие screenbuffer и doublebuffer
//  */









// struct ScreenBuffer {
//     int w, h;
//     std::vector<char> data;

//     ScreenBuffer(int w, int h)
//         : w(w), h(h), data(w * h, ' ') {}

//     void clear(char c = ' ') {
//         std::fill(data.begin(), data.end(), c);
//     }

//     void set(int x, int y, char c) {
//         if (x < 0 || y < 0 || x >= w || y >= h) return;
//         data[y * w + x] = c;
//     }

//     char get(int x, int y) const {
//         return data[y * w + x];
//     }
// };


// struct DoubleBuffer {
//     ScreenBuffer front;
//     ScreenBuffer back;

//     DoubleBuffer(int w, int h)
//         : front(w, h), back(w, h) {}

//     ScreenBuffer& draw() {   // куда рисуем
//         return back;
//     }

//     const ScreenBuffer& display() const { // что показываем
//         return front;
//     }

//     void swap() {
//         std::swap(front.data, back.data);
//     }
// };

